Tekla Open API Reference for Tekla Structures 2025
Edge.Type Property
 Gets the type of the edge.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Edge.EdgeTypeEnum Type { get; }
Public ReadOnly Property Type As Edge.EdgeTypeEnum
	Get
Property Value
Type: Edge.EdgeTypeEnum
See Also
Reference
Edge Class
Tekla.Structures.Solid Namespace